const { randElement, clubLink } = require("../../api/utils");

module.exports = {
    r: /^(магазин|shop)$/i,
    payload: "shop",
    async f(msg) {
        msg.send(`${msg.prefix}категории магазина:
🏘 Имущество:
⠀⠀🏠 Дома
⠀⠀✈ Самолеты
⠀⠀🛥 Яхты

💱 Валюты:
⠀⠀💳 Коины
⠀⠀⚜️ Золото

💲 Заработок:
⠀⠀💸 Бизнес

📌 Разное:
⠀⠀📦 Кейс
⠀⠀🔫 Патроны
⠀⠀🧛‍♂️ Магазин мафии

🔎 Для покупки, введите название подкатегории. Пример: ${clubLink(randElement(["Золото", "Бизнес", "Яхта", "Кейс", "Патроны"]))}`);
    }
}